{
  "reply_registration": {
    "/start": [0, 0, 0],
    "unregister_error": [1, 0, 0],
    "register_error": [1, 1, 0],

    "Где я?": [2, 0, 0],
    "Кем я могу стать?": [3, 0, 0],
    "Кто ты?": [4, 0, 0],
    "О ролевой": [5, 0, 0],

    "Начать приключение!": [6, null, 1],
    "name": [7, 2, 2],
    "race": [8, null, 3],
    "age": [9, 3, 4],
    "gender": [10, null, 5],
    "bio": [11, 4, 6],
    "invalid_input": [13, null, 0],
    "О расах": [3, 2, 2],
    "Всё верно": [12, 1, 0],
    "Нет, ещё раз!": [6, null, 1],
    "race_fail": [13, 2, 2],
    "age_fail": [13, null, 3],
    "gender_fail": [13, 3, 4],
    "checkup_fail": [6, null, 1],
    "registration_fail": [0, 0, 0],
    "already_registered": [14, 1, 0]
  },

  "reply_registered": {
    "message_error": [13, 1, 0],

    "Персонаж": [17, 6, 0],
      "Статистика": [19, 8, 0],
        "Биография": [20, 9, 0],
          "Редактировать биографию": [21, 10, 7],
            "confirm_bio": [22, 1, 0],
        "Записная книжка": [23, 11, 0],
          "Сделать заметку": [24, 10, 8],
            "confirm_note": [25, 1, 0],
          "Новая книжка": [26, 12, 9],
            "Да, удалить заметки": [27, 1, 0],
        "Собственность": [28, 1, 0],

    "Инвентарь": [18, 7, 0],
    "Мир": [13, 1, 0],
    "Действия": [13, 1, 0],
    "Помощь": [13, 1, 0],
    "Ошибки": [13, 1, 0],
    "Назад": [15, 1, 0],
    "Задания": [16, 1, 0]
  },

  "message": [
    "А, это ты. Ну что ж, садись, раз пришёл… \nХорошо, что ты нашёл меня, а не моего старого знакомого, Фринса. Он вообще мог отправить твою душеньку в тело какого-то Трумбо. И бродил бы ты по острову в гордом животном одиночестве.\nЛадно, не суть. \nПопытаюсь тебе объяснить ситуацию. Твоя душа сейчас находится в состоянии суперпозиции. И пока что только я могу её видеть, вот так!\nНо я предлагаю тебе сделку. Стать частью интересного мира в образе разумного существа, которое имеет возможность стать героем, великим волшебником, политиком, а может быть даже самим полубогом. Всё зависит от удачи этого существа. Ну и от силы твоей души, конечно же. Я могу это сделать, но в обмен ты соглашаешься, что я буду владеть всей информацией о твоих передвижениях по Раумору, твоём прогрессе и умениях. Конечно, я буду помогать тебе с этой информацией, выдавая её тебе при первой твоём желании, с помощью моей телепатии.\nТы можешь меня спросить то, что тебе интересно, а можешь сразу ринуться подыскивать себе тело!\n",

    "Я не особо понимаю, что ты имеешь в виду. Попробуй сказать иначе.",
    "Ты, юная душа, в мире Создателя Хаоса, Рауморе. Его населяет 4 основных разумных расы – порождений своих Богов и Богинь, детей Хаоса.  После многих событий, о которых тебе удастся узнать в своём приключении, ситуация в мире сложилась таким образом:\nСуществуют четыре основных материка рас, их 'Родина'. С их законами, культурой и верованием. \nТы, вселившись в одного из этих разумных существ, начнёшь свой путь именно с одного из этих материков. Так же, существует КОМ – Конфедерация Основного Материка, куда ты можешь добраться. Именно там находятся нейтральные законы для всех рас, мировое правительство, храм Хаоса, а так же вершина мирового прогресса, бриллиант новейшего времени, Институт Хаоса, в простонародье имеющий название 'Пансионат'",
    "На твой выбор, юная душа, представляется 4 разумных расы. Аласи, Артифексы, Перевёртыши и Вечные.\nТы можешь стать представителем одной из этих рас, юным (или не очень) существом, которое начнёт свой путь к славе в опасном мире Раумор.\nВыбрав одну из рас – ты сам начинаешь писать своё приключение. Хочешь быть мореплавателем? Пожалуйста! Или же заняться добычей полезных руд в шахте возле вулкана? Без проблем! Выбор лишь за тобой.\nЯ тебе немного расскажу о доступных расах, прежде чем ты сделаешь свой выбор:\n\nВечные – Скрытые, тёмные, высокие и худощавые. Истинные тёмные маги, которым доступна самая неизведанная – магия сна. Их продолжительность жизни до сих пор не определена, но, поговаривают, они могут жить и до тысячи лет. Их самый главный недостаток – они не могут находиться в этом мире больше восьми часов. Им необходимо, хотя бы раз в 8 часов, спускаться в своё измерение. Такое проклятие им выдал Создатель Хаос, за совершенное преступление их Бога – старшей дочери Хаоса - Морты.  Они физически слабы, мало защищены от ближнего боя, но с их умением магической атаки не сравнится никто. \n\nАласи – Порождения самой старшей дочери Хаоса, Богини Виты. В какой-то степени, священные существа с хрупким телом и крыльями. Обладают способностью летать, от чего развивают самую большую скорость из всех рас, что и является их главным преимуществом. Так же, как и Вечные, слабы физически, но хорошие маги, в чём могут сравниться по силе с Вечными. Их Магия жизни является больше оборонительной магией,  чем атакующей. Зачастую Аласи – превосходные политические деятели, врачи, профессора, священнослужители.  По благословению Виты Хаосом стали обладать фактическим бессмертием. Они не стареют, но случайный зачарованный кинжал вполне может их убить. Именно из-за этого Аласи зачастую ведут оседлый образ жизни, занимая государственные должности, и редко являются искателями приключений. \n\nАртифекты -- Остроухие, высокие, мускулистые полу-машины с бледной кожей, похожие на обитателей подземных миров. Эта раса, созданная младшим сыном Хаоса, Богом Артифом, является самой технологически развитой на Планете. Они слабее всех подвержены магии, они медлительны, но при этом могут поднимать большие грузы, и их главный козырь, помимо интеллекта – физическая сила и выносливость. Их магия Машин служит, скорее, для разработки, модернизации и зачарования их всевозможных аппаратов и орудий, нежели для магических дуэлей. Прекрасные существа для любителей кузнечного дела, большой грузоподъёмности, а так же решения дел физической силой.\n\nПеревёртыши – Звероподобные существа, обладающие разумом, данным им средним сыном Хаоса – Р`а-аки. Разные виды этих существ, будь то ящеры, волки, имеют свой вид морды/лица, схожий с животными.\nРост в больших случаях варьируется от 1.4 до 1.8 метра.\nПеревёртыши тесно связаны с животным миром, и связь эта проявляется во внешнем виде, их поведении, религии и магии. \nИм лучше всего подходит магия элементов, так как они максимально гармоничны с собой и окружающим миром. \nИз-за их приближённости к природе, являются самой сбалансированной расой, от чего берутся почти любую работу в мире Раумор.  \n\nТак же, я не мог не упомянуть свою расу, Хвостатых! О ней ты сможешь узнать поподробнее только тогда, когда их встретишь. Мы, лисы, скрытая раса, но кое-что о нас всем известно.\nПри определённых обстоятельствах, которые ты сможешь узнать из древних легенд, мы отошли от основной расы Перевёртышей, основав свою маленькую «колонию» где-то на Планете. Тебе я не расскажу наше месторасположение, а то сможешь нас выдать, хе-хе. Мы быстры, а о нашем навыке владения мечом слагают истории. Из нас получились бы прекрасные наёмники! \nНо, у нас есть недостаток. Из-за потери связи со своим Божеством напрямую, мы не имеем никакой магии, кроме нашей собственной. \n\nПожалуй, это всё, что тебе надо знать о разумных существах мира Раумор.",
    "Я - Лис. Хвостатый демон, что владеет всей информацией. Обожаю приключения и маленьких милых лисят.",
    "Мы, создатели ролевого мира Раумор, надеемся, что Вы получите удовольствие от игрового процесса, общения в приятной компании, а так же массы познавательных вещей!\nВ нашей ролевой Вы вольны делать то, что угодно. Наша главная цель – создание максимально открытых для действий условий, в рамках Телеграмм/Вконтакте. Ролевая совмещает в себе аспекты ММОРПГ, стратегии, а так же настольно-ролевой и ролевой игры. В ней Вы действительно можете развивать политику, торговлю, науку. Создавать новые рабочие заклинания, или же открыть свою кузницу и ковать мечи. А может, Вы хотите отправиться на исследование опасных участков мира, одолев мощных монстров? Всё это Вы сможете сделать в нашей ролевой!\nПолезные ссылки: \n ...",

    "Душа, в материальном мире у каждого существа есть своё название, своё слово, на которое он отзывается. Как ты хочешь, чтоб тебя звали? Запомни, имя запишется в скрижалях. Изменить его, подобно ветру истории, практически невозможно, так что подумай хорошо перед ответом. Твоё имя: ",
    "Отлично, приятно познакомиться! Ты всё ближе на пути к материализации. Из какой расы твоё существо? Ты можешь выбрать между: \n1. Аласи,\n2. Вечные, \n3. Артифексы\n4. Перевёртыши",
    "Ты уже определился с именем и расой собственного материального я. Похвально. Теперь скажи, сколько тебе планетарных лет? (От 16 до 90):",
    "Возраст ничего не значит – а вот удача лишней не будет. Теперь определись, воин ты или воинтельница: ",
    "Да будет так! Материальность всё ближе. Мир уже готов принять тебя, но для его обитателей нужна твоя история. Придумай, кем ты был до настоящего времени. Это запишется в скрижали, как твоя биография. Ты можешь сделать это потом, просто отправив мне точку",

    "Итак, это то, что получилось:\n\n",
    "Поздравляю, Ты обрёл материальность! И в данный момент начинается твой путь героя. Помни, что я лишь обычный лис, и рассказывать обо мне всем вокруг не стоит. Вся информация о тебе будет храниться на моих записях. Если что-тот понадобится – лишь напиши.",
    "Нет, так не пойдёт. Внимательно подумай, что хочешь мне отправить: ",
    "Ты уже существуешь в этом мире! Единственный выход – возродиться как фенкис, пройдя цикл смерти и возрождения. Для удаления персонажа перейди в меню настроек.",
    "Возвращаемся!",

    "Вперёд, навстечу приключениям!",
    "Это ты – и только ты",
    "Всё, что ты можешь унести, принести, занести и взять – тут. ",
    "",
    "Вот что я о тебе знаю: ",

    "Что же ты хочешь изменить? Запиши: ",
    "Ты изменил свою историю.",
    "Сюда ты можешь записывать все интересные истории, пометки, или просто общаться с самим собой.\n",
    "Что ты хочешь написать? Максимальный объём заметки 200 символов: ",
    "Заметка добавлена!",

    "Ты действительно хочешь удалить ВСЕ заметки?",
    "Заметки удалены",
    "Вот чем ты владеешь:\n"

  ],

  "keyboard": [
    [["Где я?", "Кем я могу стать?"], ["Начать приключение!"], ["Кто ты?", "О ролевой"]],

    [["Персонаж"], ["Мир"], ["Задания"], ["Действия"], ["Помощь", "Ошибки"]],
    [["Аласи", "Вечные"], ["Артифексы", "Перевёртыши"], ["О расах"]],
    [["Господин"], ["Госпожа"]],
    [["Всё верно", "Нет, ещё раз!"]],
    [["Учёба"], ["Доступные задания"], ["Ежедневные задания"], ["Особые задания"], ["Назад"]],

    [["Статистика"], ["Навыки"], ["Инвентарь"], ["Назад"]],
    [["Рюкзак"], ["Пояс и карманы"],["Экипировка"], ["Обмен"], ["Назад"]],
    [["Биография"], ["Записная книжка"], ["Собственность"], ["Назад"]],
    [["Редактировать биографию"], ["Назад"]],
    [["Назад"]],

    [["Сделать заметку"], ["Новая книжка"], ["Назад"]],
    [["Да, удалить заметки"], ["Назад"]]
  ],

   "action": [
     null,

     "name", "race", "age", "gender", "bio",
     "checkup", "edit_bio", "add_note", "delete_notes", "own"
  ],

  "action_keys": {
    "player_stats": ["edit_bio", "confirm_bio", "add_note", "confirm_note", "delete_notes", "confirm_new_notebook"]
  }
}
